/*Вычислить значение выражения по формуле (все переменные принимают действительные значения):
        𝑏 + √𝑏
        2 + 4𝑎𝑐
        2𝑎
        − 𝑎
        3
        𝑐 + 𝑏
        −2*/

public class task1_2 {
        public static void main(String[] args) {
            double a = 5;
            double b = 3;
            double c = 12;
            int a3 = 3;
            int b2 = -2;

            double z = (b + Math.sqrt(b * b + 4 * a * c)) / (2 * a) - Math.pow(a, a3) * c + Math.pow(b, b2);
            System.out.println("при а =" + "5" + ", " + "b =" + b + ", " + " при с=" + c + ", " + "результат выражения равен" + z);
        }
    }

